nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core0.xml
        <register>
          <name>RF2p4GHz_CTRL</name>
          <description>2.4GHz Radio Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WOR_WKUP_IE</name>
              <description>WOR Wakeup Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_WKUP_IE_0</name>
                  <description>WOR wakeup interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_WKUP_IE_1</name>
                  <description>WOR wakeup interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_WKUP_IE</name>
              <description>MAN Wakeup Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_WKUP_IE_0</name>
                  <description>MAN wakeup interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_WKUP_IE_1</name>
                  <description>MAN wakeup interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_WKUP_IE</name>
              <description>Bluetooth LE Wakeup Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_WKUP_IE_0</name>
                  <description>Bluetooth LE wakeup interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_WKUP_IE_1</name>
                  <description>Bluetooth LE wakeup interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFACT_IE</name>
              <description>RF_ACTIVE Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFACT_IE_0</name>
                  <description>RF_ACTIVE interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RFACT_IE_1</name>
                  <description>RF_ACTIVE interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_WKUP_IE</name>
              <description>Low Power Wakeup Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_WKUP_IE_0</name>
                  <description>Low Power wakeup interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_WKUP_IE_1</name>
                  <description>Low Power wakeup interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_WKUP</name>
              <description>Bluetooth LE Wakeup</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_WKUP_0</name>
                  <description>Bluetooth LE low power mode wakeup deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_WKUP_1</name>
                  <description>Bluetooth LE low power mode wakeup asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_LP_EN</name>
              <description>Bluetooth LE Low Power Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_LP_EN_0</name>
                  <description>Bluetooth LE wakeup request disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_LP_EN_1</name>
                  <description>Bluetooth LE wakeup request enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_ENTER</name>
              <description>S/W Low Power Entry Request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_ENTER_0</name>
                  <description>Deassert S/W request for low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_ENTER_1</name>
                  <description>Assert S/W request for low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_MODE</name>
              <description>Radio Low Power Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_MODE_0</name>
                  <description>Active: clock gating only (only intended for debug)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_MODE_1</name>
                  <description>Sleep: clock gating, PMC in low power mode(only intended for debug)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_MODE_3</name>
                  <description>Deep Sleep: low power static mode with retention of digital logic and SRAMs.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_MODE_7</name>
                  <description>Power Down: power down of radio digital logic, optional SRAM retention.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_MODE_15</name>
                  <description>Deep Power Down: power down of radio digital logic and SRAMs.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_WKUP_DLY</name>
              <description>LP Wakeup Delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFA_TRIG_EN</name>
              <description>SFA Trigger Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_TRIG_EN_0</name>
                  <description>Bluetooth LE Low Power Controller is not allowed to cause an SFA trigger.</description>
                  <value>#0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_EN_0</name>
                  <description>WOR Low Power Controller is not allowed to cause an SFA trigger.</description>
                  <value>#x0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_EN_0</name>
                  <description>MAN Low Power Controller is not allowed to cause an SFA trigger.</description>
                  <value>#xx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_EN_1</name>
                  <description>MAN Low Power Controller is allowed to cause an SFA trigger.</description>
                  <value>#xx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_EN_2</name>
                  <description>WOR Low Power Controller is allowed to cause an SFA trigger.</description>
                  <value>#x1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_EN_4</name>
                  <description>Bluetooth LE Low Power Controller is allowed to cause an SFA trigger.</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_STOP_REQ_GLITCH_DIS</name>
              <description>LP_STOP_REQ Glitch Disable for 2.4GHz Radio</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XO_EN_GLITCH_DIS</name>
              <description>XO_EN Glitch Disable for 2.4GHz Radio</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XO_EN</name>
              <description>XO Enable for 2.4GHz Radio</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_EN_0</name>
                  <description>XO software enable deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_EN_1</name>
                  <description>XO software enable asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_OVR</name>
              <description>Clock Gating Override</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_OVR_0</name>
                  <description>Bluetooth LE power controller clock (and 32kHz clock used by Bluetooth LE link layer) only enabled when BLE_LP_EN=1 (default)</description>
                  <value>#0xxx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_0</name>
                  <description>WOR power controller clock only enabled when WOR_EN=1 (default)</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_0</name>
                  <description>MAN power controller clock only enabled when MAN_EN=1 (default)</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_0</name>
                  <description>TIMER clock only enabled when TIM_EN=1</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_1</name>
                  <description>TIMER clock always enabled</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_2</name>
                  <description>MAN power controller clock always enabled</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_4</name>
                  <description>WOR power controller clock always enabled</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_OVR_8</name>
                  <description>Bluetooth LE power controller clock (and 32kHz clock used by Bluetooth LE link layer) always enabled</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU_RST_LOCK</name>
              <description>LOCK for CPU_RST</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU_RST_LOCK_0</name>
                  <description>CPU_RST bit is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_RST_LOCK_1</name>
                  <description>CPU_RST bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPU_RST</name>
              <description>S/W Reset for 2.4GHz Radio CPU</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU_RST_0</name>
                  <description>Release the 2.4GHz radio CPU from reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_RST_1</name>
                  <description>Hold the 2.4GHz radio CPU in reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_POR</name>
              <description>S/W Power-on-Reset for 2.4GHz Radio</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_POR_0</name>
                  <description>Release the 2.4GHz radio from power-on-reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_POR_1</name>
                  <description>Hold the 2.4GHz radio in power-on-reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>S/W Reset for 2.4GHz Radio</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_0</name>
                  <description>Release the 2.4GHz radio from reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_1</name>
                  <description>Hold the 2.4GHz radio in reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
