nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core0.xml
        <register>
          <name>MULT_PKT_CTRL</name>
          <description>MULT_PKT_CTRL</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEG_SZ</name>
              <description>RAM Segment Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_INDEX</name>
              <description>Packet Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEG_BASE_ADDR</name>
              <description>Segment Offset Address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESET_PKT_IDX</name>
              <description>Reset the PKT_INDEX to zero</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MULT_PKT_EN</name>
              <description>Enable to send or receive multiple packets</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Send or receive multiple packets is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Send or receive multiple packets is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RPA_WL_STATUS</name>
          <description>RPA AND WHITE LIST STATUS</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F003F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WL_MATCH_INDEX</name>
              <description>The matched white list index of the identity address resolved(RPA is enabled) or peer address received(RPA is not enabled)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PEER_RESOLVED_INDEX</name>
              <description>The matched RPA index of peer address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCAL_RESOLVED_INDEX</name>
              <description>The matched RPA index of local address</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEARCH_WL</name>
              <description>Search Identity Address in White List</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LENGTH_MAX</name>
          <description>MAXIMUM LENGTH</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENGTH_MAX</name>
              <description>Maximum Length for Received Packets</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REC_BAD_PKT</name>
              <description>Receive Bad Packets</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REC_BAD_PKT_0</name>
                  <description>packets which fail H0, H1, or LENGTH_MAX result in an automatic recycle after the header is received and parsed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REC_BAD_PKT_1</name>
                  <description>packets which fail H0, H1, or LENGTH_MAX are received in their entirety</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT_TMR_LD</name>
          <description>EVENT TIMER LOAD</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT_TMR_LD</name>
              <description>Event Timer Load</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT_TMR_ADD</name>
          <description>EVENT TIMER ADD</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT_TMR_ADD</name>
              <description>Event Timer Add</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENH_FEATURE</name>
          <description>ENHANCED FEATURES</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENLL_MODE</name>
              <description>Link layer Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GENLL_MODE0</name>
                  <description>GLL Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE1</name>
                  <description>PAN Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE2</name>
                  <description>FAN Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE3</name>
                  <description>Hybrid Dual PAN Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE6</name>
                  <description>FCP Mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE9</name>
                  <description>Bluetooth LE Uncoded Mode</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE10</name>
                  <description>Bluetooth LE LR Mode</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE11</name>
                  <description>Bluetooth LE Concurrent Mode (RX configuration only; TX uses either Bluetooth LE UNCODED or Bluetooth LE LR configuration)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE15</name>
                  <description>GTM Mode</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_RXIRQ</name>
              <description>Select the RX IRQ assert time</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>RX_IRQ is asserted at the end of RX_PKT state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>RX_IRQ is asserted at the end of RXEN_DLY state. This to be used for delaying RX_IRQ to accept TERM2 bits in Bluetooth LE-LR and CTE bits as needed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATARATE_CONFIG_SEL</name>
              <description>Select the data rate configuration bank</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Select the data rate as per configuration bank 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Select the data rate as per configuration bank 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STAY_IN_RX</name>
              <description>Stay in receive</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Link layer will warm-down after an RX_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Link layer will recycle and stay in receive even after an RX_IRQ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHR_TYPE</name>
              <description>PHR Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GFSK</name>
                  <description>The packet type is GFSK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK</name>
                  <description>The packet type is MSK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUNFSK</name>
                  <description>The packet type is SUN FSK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LECIMFSK</name>
                  <description>The packet type is LECIM FSK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_BUILD_ACK</name>
              <description>Software builds the ACK packet in RAM</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Hardware builds part of or the whole of the auto ACK frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Software builds the whole auto ACK frame in RAM.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKBUF_SEL</name>
              <description>ACK frame is in 64-byte dedicated RAM or TX buffer RAM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>ACK frame is in 64-byte dedicated RAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>ACK frame is in TX buffer RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOACK</name>
              <description>Auto Acknowledge Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOACK_0</name>
                  <description>sequence manager will not follow a receive frame with a Tx Ack frame, under any conditions; the auto-sequence will terminate after the receive frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOACK_1</name>
                  <description>sequence manager will follow a receive frame with an automatic hardware-generated Tx Ack frame, assuming other necessary conditions are met.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXACKRQD</name>
              <description>Receive Acknowledge Frame required</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXACKRQD_0</name>
                  <description>An ordinary receive frame (any type of frame) follows the transmit frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACKRQD_1</name>
                  <description>A receive Ack frame is expected to follow the transmit frame (non-Ack frames are rejected).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOTTED</name>
              <description>Slotted Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LENGTH_ACK</name>
              <description>Length of the ACK frame(or part of the ACK frame) in RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_V5P1_CTE_EN</name>
              <description>Bluetooth LE version 5.1 CTE feature enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_V5P1_CTE_EN_0</name>
                  <description>Do not support Bluetooth LE version 5.1 CTE feature.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_V5P1_CTE_EN_1</name>
                  <description>Support Bluetooth LE version 5.1 CTE feature, which means the link layer hardware can parse the CTE field length and extend the RX_EN signal accordingly.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
