nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core0.xml
        <register>
          <name>TIMING01</name>
          <description>TSM_TIMING01</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RF_STATUS_TX_HI</name>
              <description>Assertion time setting for RF_STATUS (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_STATUS_TX_LO</name>
              <description>De-assertion time setting for RF_STATUS (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_STATUS_RX_HI</name>
              <description>Assertion time setting for RF_STATUS (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_STATUS_RX_LO</name>
              <description>De-assertion time setting for RF_STATUS (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING02</name>
          <description>TSM_TIMING02</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RF_PRIORITY_TX_HI</name>
              <description>Assertion time setting for RF_PRIORITY (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_PRIORITY_TX_LO</name>
              <description>De-assertion time setting for RF_PRIORITY (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_PRIORITY_RX_HI</name>
              <description>Assertion time setting for RF_PRIORITY (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_PRIORITY_RX_LO</name>
              <description>De-assertion time setting for RF_PRIORITY (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING03</name>
          <description>TSM_TIMING03</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ0_START_TRIG_TX_HI</name>
              <description>Assertion time setting for IRQ0_START_TRIG (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ0_START_TRIG_TX_LO</name>
              <description>De-assertion time setting for IRQ0_START_TRIG (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ0_START_TRIG_RX_HI</name>
              <description>Assertion time setting for IRQ0_START_TRIG (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ0_START_TRIG_RX_LO</name>
              <description>De-assertion time setting for IRQ0_START_TRIG (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING04</name>
          <description>TSM_TIMING04</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQ1_STOP_TRIG_TX_HI</name>
              <description>Assertion time setting for IRQ1_STOP_TRIG (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ1_STOP_TRIG_TX_LO</name>
              <description>De-assertion time setting for IRQ1_STOP_TRIG (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ1_STOP_TRIG_RX_HI</name>
              <description>Assertion time setting for IRQ1_STOP_TRIG (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ1_STOP_TRIG_RX_LO</name>
              <description>De-assertion time setting for IRQ1_STOP_TRIG (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING05</name>
          <description>TSM_TIMING05</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO0_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO0_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO0_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO0_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING06</name>
          <description>TSM_TIMING06</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO1_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO1_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO1_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO1_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO1_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING07</name>
          <description>TSM_TIMING07</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO2_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO2_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO2_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO2_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO2_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING08</name>
          <description>TSM_TIMING08</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO3_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO3_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO3_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO3_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO3_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING09</name>
          <description>TSM_TIMING09</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5700FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_GAIN_CFG_EN_TX_HI</name>
              <description>Assertion time setting for DCOC_GAIN_CFG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_GAIN_CFG_EN_TX_LO</name>
              <description>De-assertion time setting for DCOC_GAIN_CFG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_GAIN_CFG_EN_RX_HI</name>
              <description>Assertion time setting for DCOC_GAIN_CFG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_GAIN_CFG_EN_RX_LO</name>
              <description>De-assertion time setting for DCOC_GAIN_CFG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING10</name>
          <description>TSM_TIMING10</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11081108</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LDO_CAL_EN_TX_HI</name>
              <description>Assertion time setting for LDO_CAL_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_CAL_EN_TX_LO</name>
              <description>De-assertion time setting for LDO_CAL_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_CAL_EN_RX_HI</name>
              <description>Assertion time setting for LDO_CAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_CAL_EN_RX_LO</name>
              <description>De-assertion time setting for LDO_CAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING11</name>
          <description>TSM_TIMING11</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B137113</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_DIG_EN_TX_HI</name>
              <description>Assertion time setting for PLL_DIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_TX_LO</name>
              <description>De-assertion time setting for PLL_DIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_RX_HI</name>
              <description>Assertion time setting for PLL_DIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIG_EN_RX_LO</name>
              <description>De-assertion time setting for PLL_DIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING12</name>
          <description>TSM_TIMING12</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B19714F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIGMA_DELTA_EN_TX_HI</name>
              <description>Assertion time setting for SIGMA_DELTA_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_TX_LO</name>
              <description>De-assertion time setting for SIGMA_DELTA_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_RX_HI</name>
              <description>Assertion time setting for SIGMA_DELTA_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGMA_DELTA_EN_RX_LO</name>
              <description>De-assertion time setting for SIGMA_DELTA_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING13</name>
          <description>TSM_TIMING13</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x572DFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_EN_TX_HI</name>
              <description>Assertion time setting for DCOC_CAL_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_EN_TX_LO</name>
              <description>De-assertion time setting for DCOC_CAL_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_EN_RX_HI</name>
              <description>Assertion time setting for DCOC_CAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_EN_RX_LO</name>
              <description>De-assertion time setting for DCOC_CAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING14</name>
          <description>TSM_TIMING14</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x716F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_DIG_EN_TX_HI</name>
              <description>Assertion time setting for TX_DIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DIG_EN_TX_LO</name>
              <description>De-assertion time setting for TX_DIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING15</name>
          <description>TSM_TIMING15</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B58716F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQ_TARG_LD_EN_TX_HI</name>
              <description>Assertion time setting for FREQ_TARG_LD_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_TX_LO</name>
              <description>De-assertion time setting for FREQ_TARG_LD_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_RX_HI</name>
              <description>Assertion time setting for FREQ_TARG_LD_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TARG_LD_EN_RX_LO</name>
              <description>De-assertion time setting for FREQ_TARG_LD_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING16</name>
          <description>TSM_TIMING16</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x59580000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_INIT_RX_HI</name>
              <description>Assertion time setting for RX_INIT (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_INIT_RX_LO</name>
              <description>De-assertion time setting for RX_INIT (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
