nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core0.xml
        <register>
          <name>TIMING48</name>
          <description>TSM_TIMING48</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B23715A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_TX_HI</name>
              <description>Assertion time setting for SEQ_DIVN_CLOSEDLOOP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_TX_LO</name>
              <description>De-assertion time setting for SEQ_DIVN_CLOSEDLOOP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_RX_HI</name>
              <description>Assertion time setting for SEQ_DIVN_CLOSEDLOOP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DIVN_CLOSEDLOOP_RX_LO</name>
              <description>De-assertion time setting for SEQ_DIVN_CLOSEDLOOP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING49</name>
          <description>TSM_TIMING49</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B23715A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PD_EN_PD_DRV_TX_HI</name>
              <description>Assertion time setting for SEQ_PD_EN_PD_DRV (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_TX_LO</name>
              <description>De-assertion time setting for SEQ_PD_EN_PD_DRV (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_RX_HI</name>
              <description>Assertion time setting for SEQ_PD_EN_PD_DRV (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_PD_DRV_RX_LO</name>
              <description>De-assertion time setting for SEQ_PD_EN_PD_DRV (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING50</name>
          <description>TSM_TIMING50</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B2BFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_CBPF_EN_DCOC_TX_HI</name>
              <description>Assertion time setting for SEQ_CBPF_EN_DCOC (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_TX_LO</name>
              <description>De-assertion time setting for SEQ_CBPF_EN_DCOC (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_RX_HI</name>
              <description>Assertion time setting for SEQ_CBPF_EN_DCOC (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_CBPF_EN_DCOC_RX_LO</name>
              <description>De-assertion time setting for SEQ_CBPF_EN_DCOC (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING51</name>
          <description>TSM_TIMING51</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B2BFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_RX_GANG_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_GANG_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_GANG_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RX_GANG_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_(RX_LAN/RX_MIX/CBPF/ADC_PUP) and SEQ_SPARE1 (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING52</name>
          <description>TSM_TIMING52</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_SPARE3_TX_HI</name>
              <description>Assertion time setting for SEQ_SPARE3 (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_TX_LO</name>
              <description>De-assertion time setting for SEQ_SPARE3 (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_RX_HI</name>
              <description>Assertion time setting for SEQ_SPARE3 (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_SPARE3_RX_LO</name>
              <description>De-assertion time setting for SEQ_SPARE3 (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING53</name>
          <description>TSM TIMING_53</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B23715A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GEAR_SHIFT_TX_HI</name>
              <description>Assertion time setting for GEAR_SHIFT (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEAR_SHIFT_TX_LO</name>
              <description>De-assertion time setting for GEAR_SHIFT (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEAR_SHIFT_RX_HI</name>
              <description>Assertion time setting for GEAR_SHIFT (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEAR_SHIFT_RX_LO</name>
              <description>De-assertion time setting for GEAR_SHIFT (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING54</name>
          <description>TSM TIMING_54</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PIC_CORE_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_PIC_CORE_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_CORE_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_CORE_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_CORE_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_PIC_CORE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_CORE_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_CORE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING55</name>
          <description>TSM TIMING_55</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PIC_SHORT_CINT_SHORT_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_SHORT_CINT_SHORT_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_SHORT_CINT_SHORT_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_SHORT_CINT_SHORT_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_SHORT_CINT_SHORT_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING56</name>
          <description>TSM TIMING_56</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_FILTER_LOW_BW_SM_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_FILTER_LOW_BW_SM_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING57</name>
          <description>TSM TIMING_57</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PIC_RFB_OPEN_SM_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RFB_OPEN_SM_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RFB_OPEN_SM_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RFB_OPEN_SM_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_RFB_OPEN_SM_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING58</name>
          <description>TSM TIMING_58</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PIC_RINT2_SHORT_FM_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RINT2_SHORT_FM_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RINT2_SHORT_FM_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PIC_RINT2_SHORT_FM_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_PIC_RINT2_SHORT_FM_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING59</name>
          <description>TSM TIMING_59</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LODIV_SYNC_RESET_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_LODIV_SYNC_RESET_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_RESET_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_LODIV_SYNC_RESET_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_RESET_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_LODIV_SYNC_RESET_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_RESET_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_LODIV_SYNC_RESET_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING60</name>
          <description>TSM TIMING_60</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LODIV_SYNC_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_LODIV_SYNC_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_LODIV_SYNC_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_LODIV_SYNC_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_LODIV_SYNC_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING61</name>
          <description>TSM TIMING_61</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LODIV_SYNC_SPARE_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_SPARE_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_SPARE_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LODIV_SYNC_SPARE_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_LODIV_SYNC_SPARE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
