nxp-mcuxpresso/mcux-soc-svd/KW47B42Z97/KW47B42Z97_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_ANALOG</name>
      <description>XCVR_ANALOG</description>
      <groupName>XCVR_ANALOG</groupName>
      <baseAddress>0x48A07C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LDO_0</name>
          <description>RF Analog Baseband LDO Control 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BG_FORCE</name>
              <description>reg_bg_force_dig</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BG_FORCE_0</name>
                  <description>force disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BG_FORCE_1</name>
                  <description>force enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_LV_TRIM</name>
              <description>reg_ldo_lv_trim_dig[1:0]</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_LV_TRIM_0</name>
                  <description>0.91V Default LDO output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_LV_TRIM_1</name>
                  <description>0.86V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_LV_TRIM_2</name>
                  <description>0.97V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_LV_TRIM_3</name>
                  <description>1.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_LV_BYPASS</name>
              <description>reg_ldo_lv_bypass_dig</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_LV_BYPASS_0</name>
                  <description>disable bypass for ldo_lv</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_LV_BYPASS_1</name>
                  <description>enable bypass for ldo_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_RXTXHF_FORCE</name>
              <description>reg_ldo_rxtxhf_force_dig</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_RXTXHF_FORCE_0</name>
                  <description>Force disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXHF_FORCE_1</name>
                  <description>Force enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_RXTXHF_PTAT_BUMP</name>
              <description>reg_ldo_rxtxhf_ptat_bump_dig</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_RXTXHF_PTAT_BUMP_0</name>
                  <description>nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXHF_PTAT_BUMP_1</name>
                  <description>+30%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXHF_PTAT_BUMP_2</name>
                  <description>nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXHF_PTAT_BUMP_3</name>
                  <description>+30%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_RXTXHF_BYPASS</name>
              <description>reg_ldo_rxtxihf_bypass_dig</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RXTXLF_FORCE</name>
              <description>reg_ldo_rxtxlf_force_dig</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_RXTXLF_FORCE_0</name>
                  <description>disable force</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXLF_FORCE_1</name>
                  <description>enable force</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_RXTXLF_PTAT_BUMP</name>
              <description>reg_ldo_rxtxlf_ptat_bump_dig[1:0]</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_RXTXLF_PTAT_BUMP_0</name>
                  <description>nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXLF_PTAT_BUMP_1</name>
                  <description>+30%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXLF_PTAT_BUMP_2</name>
                  <description>nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXLF_PTAT_BUMP_3</name>
                  <description>+30%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_RXTXLF_BYPASS</name>
              <description>reg_ldo_rxtxlf_bypass_dig</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_RXTXLF_BYPASS_0</name>
                  <description>Bypass disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_RXTXLF_BYPASS_1</name>
                  <description>Bypass enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_PLL_FORCE</name>
              <description>reg_ldo_pll_force_dig</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_PLL_FORCE_0</name>
                  <description>force disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_PLL_FORCE_1</name>
                  <description>force enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_PLL_PTAT_BUMP</name>
              <description>reg_ldo_pll_ptat_bump_dig[1:0]</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_PLL_PTAT_BUMP_0</name>
                  <description>nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_PLL_PTAT_BUMP_1</name>
                  <description>+30%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_PLL_PTAT_BUMP_2</name>
                  <description>nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_PLL_PTAT_BUMP_3</name>
                  <description>+30%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_PLL_BYPASS</name>
              <description>reg_ldo_pll_bypass_dig</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_PLL_BYPASS_0</name>
                  <description>Bypass disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_PLL_BYPASS_1</name>
                  <description>Bypass enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_VCO_FORCE</name>
              <description>reg_ldo_vco_force_dig</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VCO_FORCE_0</name>
                  <description>Force disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VCO_FORCE_1</name>
                  <description>Force enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_VCO_PTAT_BUMP</name>
              <description>reg_ldo_vco_ptat_bump_dig[1:0]</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VCO_PTAT_BUMP_0</name>
                  <description>nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VCO_PTAT_BUMP_1</name>
                  <description>+30%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VCO_PTAT_BUMP_2</name>
                  <description>nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VCO_PTAT_BUMP_3</name>
                  <description>+30%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_VCO_BYPASS</name>
              <description>reg_ldo_vco_bypass_dig</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_VCO_BYPASS_0</name>
                  <description>disable VCO bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_VCO_BYPASS_1</name>
                  <description>eable VCO bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_CAL_FORCE</name>
              <description>reg_ldo_cal_force_dig</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_CAL_FORCE_0</name>
                  <description>Force disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_CAL_FORCE_1</name>
                  <description>Force enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_CAL_PTAT_BUMP</name>
              <description>reg_ldo_vco_ptat_bump_dig[1:0]</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_CAL_PTAT_BUMP_0</name>
                  <description>nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_CAL_PTAT_BUMP_1</name>
                  <description>+30%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_CAL_PTAT_BUMP_2</name>
                  <description>nominal</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_CAL_PTAT_BUMP_3</name>
                  <description>+30%</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_CAL_BYPASS</name>
              <description>reg_ldo_cal_bypass_dig</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_CAL_BYPASS_0</name>
                  <description>disable CAL bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_CAL_BYPASS_1</name>
                  <description>eable CAL bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDOTRIM_TRIM_VREF</name>
              <description>reg_ldotrim_trim_vref_dig[1:0]</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDOTRIM_TRIM_VREF_0</name>
                  <description>0.810</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOTRIM_TRIM_VREF_1</name>
                  <description>0.832</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOTRIM_TRIM_VREF_2</name>
                  <description>0.854</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDOTRIM_TRIM_VREF_3</name>
                  <description>0.788</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
